# SQL CRUD 

In this activity, you will apply `SQL` CRUD operations to a database of account payments. You will need to SELECT and filter data using SQL then INSERT, UPDATE, and DELETE records from the tables.

## Instructions

Complete the following steps:

1. Import the SQLAlchemy module.

2. Create a database connection string that imports the `bank_payments.db` from the Resources folder.

3. Create a [database engine object](https://docs.sqlalchemy.org/en/14/core/engines.html) that utilizes the database connection string.

4. Get a list of the tables included in the in the database.

5. Run a query that `SELECT`s all of the data from the `banks` table.

6. Using a SQL `SELECT` statement, find the bank routing number of the bank where the bank name equals 'TD Bank'. List the bank routing number to confirm.

7. Insert a new bank into the `banks` table. Once the query has been executed, confirm that the bank has been added to the list.
   * Use a '10' for the `bank_id`.
   * The bank name will be 'Royal Bank of Canada'.
   * The bank routing number will be '000300002'.<br>


8. `WHERE` the bank id equals 10, `UPDATE` the bank name to 'RBC'. Confirm that the bank name has been updated.

9. `DELETE` the bank where the bank id equals to 3 from `banks` table. Confirm that the bank has been deleted.

## 1. Import the SQLAlchemy module.

In [1]:
# Import modules
import sqlalchemy as sql

## 2. Create a database connection string that imports the bank_payments.db from the Resources folder.

In [2]:
# Database connection string
database_connection_string = 'sqlite:///../Resources/bank_payments.db'

## 3. Create a [database engine object](https://docs.sqlalchemy.org/en/14/core/engines.html) that utilizes the database connection string.

In [3]:
# Database engine
engine = sql.create_engine(database_connection_string, echo=True)

## 4. Get a list of the tables included in the in the database.

In [4]:
# Get table names from the database
engine.table_names()

2021-04-22 13:40:29,543 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2021-04-22 13:40:29,545 INFO sqlalchemy.engine.base.Engine ()
2021-04-22 13:40:29,546 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2021-04-22 13:40:29,547 INFO sqlalchemy.engine.base.Engine ()
2021-04-22 13:40:29,548 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-04-22 13:40:29,548 INFO sqlalchemy.engine.base.Engine ()

['banks', 'customer', 'payments']

## 5. Run a query that `SELECT`s all of the data from the `banks` table.

In [5]:
# Select all of the data from the banks table
sql_select = "SELECT * FROM banks"

# Execute the sql query
results = engine.execute(sql_select)

# List the query results
list(results)

2021-04-22 13:40:29,565 INFO sqlalchemy.engine.base.Engine SELECT * FROM banks
2021-04-22 13:40:29,566 INFO sqlalchemy.engine.base.Engine ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384)]

## 6. Using a SQL `SELECT` statement, find the bank routing number where the bank name equals 'TD Bank'.

In [6]:
# Select TD Bank's routing number
sql_select = """
SELECT bank_routing_number
FROM banks
WHERE bank_name = 'TD Bank'
"""

In [7]:
# Execute the sql statement
td_routing = engine.execute(sql_select)

2021-04-22 13:40:29,597 INFO sqlalchemy.engine.base.Engine
SELECT bank_routing_number
FROM banks
WHERE bank_name = 'TD Bank'

2021-04-22 13:40:29,598 INFO sqlalchemy.engine.base.Engine ()

In [8]:
# List the TD routing number
list(td_routing)

[(905192010,)]

## 7. Insert a new bank into the `banks` table. Once the query has been executed, confirm that the bank has been added to the list.

   * Use a '10' for the `bank_id`.
   * The bank name will be 'Royal Bank of Canada'.
   * The bank routing number will be '345826917'.

In [9]:
# Insert a new bank, Royal Bank of Canada with a bank id of 10 and a routing number of 345826917
sql_insert = """
INSERT INTO banks
(bank_id, bank_name, bank_routing_number)
VALUES
('10', 'Royal Bank of Canada', '345826917')
"""

In [10]:
# Execute the sql statement
engine.execute(sql_insert)

2021-04-22 13:40:29,647 INFO sqlalchemy.engine.base.Engine
INSERT INTO banks
(bank_id, bank_name, bank_routing_number)
VALUES
('10', 'Royal Bank of Canada', '345826917')

2021-04-22 13:40:29,648 INFO sqlalchemy.engine.base.Engine ()
2021-04-22 13:40:29,651 INFO sqlalchemy.engine.base.Engine COMMIT

In [11]:
# List the banks to confirm the new bank was added
list(engine.execute("SELECT * FROM banks"))

2021-04-22 13:40:29,669 INFO sqlalchemy.engine.base.Engine SELECT * FROM banks
2021-04-22 13:40:29,670 INFO sqlalchemy.engine.base.Engine ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'Royal Bank of Canada', 345826917)]

## 8. `WHERE` the bank id equals 10, `UPDATE` the bank name to 'RBC'. Confirm that the bank name has been updated.

In [12]:
# For the bank with and id of 10, update the bank name to 'RBC'
sql_update = """
UPDATE banks
SET bank_name = 'RBC'
WHERE bank_id = 10
"""

In [13]:
# Execute the sql statement
engine.execute(sql_update)

2021-04-22 13:40:29,708 INFO sqlalchemy.engine.base.Engine
UPDATE banks
SET bank_name = 'RBC'
WHERE bank_id = 10

2021-04-22 13:40:29,709 INFO sqlalchemy.engine.base.Engine ()
2021-04-22 13:40:29,711 INFO sqlalchemy.engine.base.Engine COMMIT

In [14]:
# List the banks to confirm the bank was updated
list(engine.execute("SELECT * FROM banks"))

2021-04-22 13:40:29,746 INFO sqlalchemy.engine.base.Engine SELECT * FROM banks
2021-04-22 13:40:29,747 INFO sqlalchemy.engine.base.Engine ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'RBC', 345826917)]

## 9. `DELETE` the bank where the bank id equals to 3 from `banks` table. Confirm that the bank has been deleted.

In [15]:
# Delete bank_id = 3 from the banks table
sql_delete = """
DELETE FROM banks
WHERE bank_id = 3
"""

In [16]:
# Execute the sql statement
engine.execute(sql_delete)

2021-04-22 13:40:29,773 INFO sqlalchemy.engine.base.Engine
DELETE FROM banks
WHERE bank_id = 3

2021-04-22 13:40:29,774 INFO sqlalchemy.engine.base.Engine ()
2021-04-22 13:40:29,777 INFO sqlalchemy.engine.base.Engine COMMIT

In [17]:
# List the banks to confirm the bank was deleted
list(engine.execute("SELECT * FROM banks"))

2021-04-22 13:40:29,796 INFO sqlalchemy.engine.base.Engine SELECT * FROM banks
2021-04-22 13:40:29,797 INFO sqlalchemy.engine.base.Engine ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'RBC', 345826917)]